/**
 * 
 */
package com.inc.gcs;

/**
 * @author 12
 *
 */
public class gcs {

	/**
	 * @param args
	 */
	public static void main(String[] args) {
		//오전 과제
		//--- 2번 과제 ---
		//1. JCombox를 선언하시오.
		//2. JCombox에 Red, Blue, Green, Yellow의 색 선택지를 추가하시오.
		//3. 색을 선택하면 해당 색으로 바탕색이 변경되게 하시오.(ItemLister 공부 후 활용)
		
		//--- 3번 과제 ---
		//1. JButten을 추가하시오.
		//2. 버튼을 더블클릭(0.5초 이내에 다시 클릭)했을 때 프로그램이 종료
		//   되도록 하시오(System.currentTimeMillis() 응용)
		
		//오후 과제
		//--- 1번 과제 : 소녀시대 게임 완성 ---
		/*
		 * 이름을 입력 후 입력버튼 누르면 현재 사진의 이름과 비교해서 틀리면 "틀렸습니다"출력, 맞으면 "맞았습니다"
		 * 출력 후 다시 렌덤한 사진 보여주기
		 */
		//--- 2번 과제 : 숫자야구 게임 완성 ---
		/*
		 * 0~9이외의 숫자를 입력했을 경우 "잘못된 입력입니다"라고 출력(예외 적용)
		 */

	}

}
